"Automatically Install" = "Инсталирај автоматски";

"Delete After Install" = "Избриши после иснталирањето";

"Remove Metadata"="Избриши Metadata";

"Keep Awake"="Држи го уклучен";

"This will keep your screen always ON while using AppCake"="Ова ке го остави екранот секогаш УКЛУЧЕН додека користите AppCake";

"Remove Metadata will stop App Store from updating the app"="Со отстранување на Metadata, ќе се спречи App Store од надоградба на апликацијата";

"Enable iTunes Sync to make apps installed by AppCake can be transfered to your computer by iTunes."="Уклучете iTunes Sync за да направите апликациите инсталирани од AppCake да можат да бидат префрлени во вашиот компјутер од страна на iTunes.";

"iTunes Sync"="iTunes Sync";

"Feedback"="Коментари";

"Changelog"="Промени";

"I Can Translate"="Јас можам да преведам";

"Clear Image Cache"="Избриши кеш од слики";

"Settings" = "Подесувања";

"Show iPhone Apps" = "Прикажете ги апликациите за iPhone";